# Importante

- Añadir a cada grafico un texto tipo Observaciones explicando como se tiene que interpretar la información.
- Añadir un índice detallado le ha molado ()![alt text](data/image.png)

- Hay que terminar con conclusiones
## Introducción

## Cosas instalación previa

- python -m ipykernel install --user --name=venv_dataset_project --display-name

## Hipotesis que se desean demostrar con los datos

- Normalización de salarios con respecto al coste de vida de los países.
- ¿Cuál es el país con

# Fuentes

- Puestos de trabajos relacionados con IA: https://www.kaggle.com/datasets/bismasajjad/global-ai-job-market-and-salary-trends-2025/data
- Análisis de coste de vida: https://www.kaggle.com/datasets/myrios/cost-of-living-index-by-country-by-number-2024

- Salario promedio por países: https://www.kaggle.com/datasets/meeratif/list-of-countries-by-average-wage-monthly-yearly
- Indice de desarrollo humano: https://hdr.undp.org/data-center/documentation-and-downloads

## Cargado de datos y primera toma de contacto

In [ ]:
import pandas as pd
import os

path_ai_jobs = os.path.join('data','ai_job_dataset.csv')
path_cost_of_living = os.path.join('data', 'Cost_of_Living_Index_by_Country_2024.csv')
path_avg_salary = os.path.join('data', 'salary_data.csv')
path_idh = os.path.join('data', 'HDR25_Statistical.xlsx')

job_df = pd.read_csv(path_ai_jobs, sep=',')
cost_of_life_df = pd.read_csv(path_cost_of_living, sep=',')
avg_salary_df = pd.read_csv(path_avg_salary, sep=',')
idh_df = pd.read_excel(path_idh, sheet_name='Table 1. HDI')

print('OFERTAR LABORALES EN IA')
display(job_df.sample(5))

# Pasamos de snake_case a Title Case y quitamos guiones bajos
job_df.columns = job_df.columns.str.replace('_', ' ').str.title().str.strip()

print('COSTE DE VIDA POR PAÍSES')
display(cost_of_life_df.sample(5))

print('SALARIO PROMEDIO POR PAÍSES')
avg_salary_df.columns = avg_salary_df.columns.str.replace('_', ' ').str.title().str.strip()
display(avg_salary_df.sample(5))

print('ÍNDICE DE DESARROLLO HUMANO (IDH)')
idh_df = idh_df.rename(columns={'Country or Area': 'Country'})
display(idh_df.sample(5))

OFERTAR LABORALES EN IA

,job_id,job_title,salary_usd,salary_currency,experience_level,employment_type,company_location,company_size,employee_residence,remote_ratio,required_skills,education_required,years_experience,industry,posting_date,application_deadline,job_description_length,benefits_score,company_name
11100,AI11101,AI Product Manager,100445,USD,SE,CT,India,L,India,50,"GCP, Docker, Kubernetes, Scala",Associate,9,Consulting,2024-07-02,2024-08-10,740,8.1,Smart Analytics
14784,AI14785,Machine Learning Engineer,155423,USD,SE,FT,Norway,M,Germany,0,"Kubernetes, Docker, Java",Bachelor,8,Healthcare,2025-02-03,2025-03-16,2372,8.3,Predictive Systems
593,AI00594,Data Scientist,47999,USD,EN,CT,Ireland,S,Ireland,0,"TensorFlow, Hadoop, Data Visualization, Git, M...",PhD,0,Finance,2024-08-17,2024-10-18,620,8.9,Neural Networks Co
5936,AI05937,Machine Learning Engineer,180456,USD,EX,PT,Japan,L,Ireland,0,"Data Visualization, Scala, Mathematics, AWS",PhD,10,Telecommunications,2024-04-18,2024-06-15,1577,5.2,Predictive Systems
8375,AI08376,Research Scientist,64708,USD,MI,FL,Austria,M,Austria,50,"Scala, Kubernetes, NLP, Java, AWS",Bachelor,2,Education,2024-03-01,2024-03-30,1979,8.9,Advanced Robotics

COSTE DE VIDA POR PAÍSES

,Rank,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
16,17,Finland,63.2,19.7,42.4,63.0,63.6,118.0
63,64,Guatemala,38.8,12.6,26.3,41.8,31.1,34.5
4,5,Barbados,76.6,19.0,48.9,80.8,69.4,43.5
2,3,Iceland,83.0,39.2,62.0,88.4,86.8,120.3
82,83,Ecuador,32.6,8.6,21.1,34.9,24.5,41.6

SALARIO PROMEDIO POR PAÍSES

,country_name,continent_name,wage_span,median_salary,average_salary,lowest_salary,highest_salary
30,Bulgaria,Europe,Monthly,1605.41,1794.59,454.05,7945.95
89,Hong Kong,Asia,Monthly,4252.87,4687.10,1182.63,20817.37
159,Philippines,Asia,Monthly,728.78,790.54,199.40,3511.56
203,Turkmenistan,Asia,Monthly,1342.86,1500.00,377.14,6657.14
141,Nepal,Asia,Monthly,551.13,608.20,153.18,2703.11

ÍNDICE DE DESARROLLO HUMANO (IDH)

,HDI rank,Country,Human Development Index (HDI),Life expectancy at birth,Expected years of schooling,Mean years of schooling,Gross national income (GNI) per capita,GNI per capita rank minus HDI rank,HDI rank.1
120,121,Venezuela (Bolivarian Republic of),0.709,72.514,12.965377,9.678385,7157.080000,11,121
33,34,Greece,0.908,81.857,20.845501,11.553856,35760.749150,17,36
103,104,Mongolia,0.747,71.734,13.637654,9.420000,14787.082370,-4,105
16,17,Liechtenstein,0.938,83.630,15.412580,12.409959,166811.674100,-16,15
156,157,Côte d'Ivoire,0.582,61.944,11.411130,4.870000,6735.416265,-21,162

<b>Modificaciones de columnas</b>

In [ ]:

display(job_df.columns)

Index(['Job Id', 'Job Title', 'Salary Usd', 'Salary Currency',
       'Experience Level', 'Employment Type', 'Company Location',
       'Company Size', 'Employee Residence', 'Remote Ratio', 'Required Skills',
       'Education Required', 'Years Experience', 'Industry', 'Posting Date',
       'Application Deadline', 'Job Description Length', 'Benefits Score',
       'Company Name'],
      dtype='object')

## Datos representativos de los datasets objeto de estudio

In [25]:
summary_df = pd.DataFrame({
    'Dataset asociado': ['Puestos de trabajo IA', 'Coste de vida', 'Salario promedio por países', 'Indice de Desarrollo Humano (IDH)'],
    'Número de entradas': [len(job_df), len(cost_of_life_df), len(avg_salary_df), len(idh_df)],
    'Número de columnas': [job_df.shape[1], cost_of_life_df.shape[1], avg_salary_df.shape[1], idh_df.shape[1]],
    'Columnas Categóricas': [
        job_df.select_dtypes(include='object').shape[1],
        cost_of_life_df.select_dtypes(include='object').shape[1],
        avg_salary_df.select_dtypes(include='object').shape[1],
        idh_df.select_dtypes(include='object').shape[1],
    ],
    'Columnas Numéricas': [
        job_df.select_dtypes(include='number').shape[1],
        cost_of_life_df.select_dtypes(include='number').shape[1],
        avg_salary_df.select_dtypes(include='number').shape[1],
        idh_df.select_dtypes(include='number').shape[1],
    ],
        'Nulos totales': [
        job_df.isnull().sum().sum(),
        cost_of_life_df.isnull().sum().sum(),
        avg_salary_df.isnull().sum().sum(),
        idh_df.isnull().sum().sum()
    ],
    'Filas duplicadas': [
        job_df.duplicated().sum(),
        cost_of_life_df.duplicated().sum(),
        avg_salary_df.duplicated().sum(),
        idh_df.duplicated().sum()
    ],
    })

display(summary_df)

,Dataset asociado,Número de entradas,Número de columnas,Columnas Categóricas,Columnas Numéricas,Nulos totales,Filas duplicadas
0,Puestos de trabajo IA,15000,19,14,5,0,0
1,Coste de vida,121,8,1,7,0,0
2,Salario promedio por países,221,7,3,4,0,0
3,Indice de Desarrollo Humano (IDH),193,9,2,7,0,0

<b>Primeras conclusiones</b>
- El dataset puestos de trabajos en IA es rico en datos teniendo 15.000 entradas y 19 columnas, lo cual, nos proporcionará una buena base para tener una visión general del mercado laboral en IA.
- Los datasets de costes de vida, salario promedio por países e índice de desarrollo humano tienen un número de entradas coherentes con el número de países que existen en el mundo, aunque hay uqe subrayar que el dataset "Coste de vida" tiene un número de entradas inferior, por lo que no se podrá hacer una comparación directa con todos los países, sino que habrá que hacer una selección de los páises que están en común entre los cuatro datasets.
- No hay valores nulos ni filas duplicadas en los datasets, lo cual es positivo para el análisis posterior.

A continuación, nos centraremos en averiguar qué países quedarán expluidos de la comparación por no tener datos en todos los datasets.

In [ ]:
x = set(job_df['company_location'].unique())
y = set(cost_of_life_df['country_name'].unique())

print(x - y)
pd.merge(job_df, cost_of_life_df, left_on='company_location', right_on='country_name')

{'Israel', 'South Korea'}

False